In [1]:
import pandas as pd

## 1. Load raw-data

In [2]:
df = pd.read_excel('../data/raw_data.xlsx')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15632 entries, 0 to 15631
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    15632 non-null  object
 1   gender  15632 non-null  object
dtypes: object(2)
memory usage: 244.4+ KB

In [3]:
df.groupby('gender').count()

        name
gender
Nam     7344
Nữ      8288

## 2. Cleaning Data

### 2.1. Normalizing strings

In [4]:
df['name'] = df['name'].str.split().str.join(' ').str.strip().str.title()
df['gender'] = df['gender'].str.strip().str.title()

### 2.2. Drop duplicated rows

In [5]:
df = df.drop_duplicates().sort_values('name').reset_index(drop=True)

In [6]:
df.groupby('gender').count()

        name
gender
Nam     6330
Nữ      6330

## 3. Split full-name into last-name and first-name

In [7]:
df['last_name'] = df.assign(last_name = df.name.str.split()) \
                    .loc[:, 'last_name'] \
                    .apply(lambda x: ' '.join(x[:-2]))
df['first_name'] = df.assign(first_name = df.name.str.split()) \
                    .loc[:, 'first_name'] \
                    .apply(lambda x: ' '.join(x[-2:]))
df.rename(columns={'name':'full_name'}, inplace=True)
df = df[['full_name','last_name','first_name','gender']]

In [8]:
df

               full_name last_name  first_name gender
0           A Ngọc Trang         A  Ngọc Trang     Nữ
1            An Gia Phúc        An    Gia Phúc    Nam
2           An Thanh Hải        An   Thanh Hải    Nam
3      An Thị Thanh Thảo    An Thị  Thanh Thảo     Nữ
4          Bao Thanh Duy       Bao   Thanh Duy    Nam
...                  ...       ...         ...    ...
12655         Đỗ Đức Đạt        Đỗ     Đức Đạt    Nam
12656    Đỗ Ức Thiên Anh     Đỗ Ức   Thiên Anh     Nữ
12657       Đới Khanh An       Đới    Khanh An    Nam
12658         Ưng Sỹ Ngà       Ưng      Sỹ Ngà    Nam
12659       Ửng Phú Vinh       Ửng    Phú Vinh    Nam

[12660 rows x 4 columns]

## 4. Save cleaned data to disk

In [9]:
df.to_excel('../data/clean_data.xlsx', index=False)